mig/app/controllers/welcome_controller.rb

  def create_new_session
    user = User.find_by(username: params[:session][:username].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "john cena"], ["LIMIT", 1]]

  def user_listing
		@users = User.all
---
SELECT "users".* FROM "users"

  def create_new_user
		@user = User.new(params.require(:user).permit(:username, :password))

		if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)